Custom 1
Hidden layer = 1
node = 16
kernel size = (3,3)
pooling size = (2,2)
activation =  relu
kernel_initializer = he normal
epoch = 30
batch size = 128

row x col = 28x28
num classes = 10
validation size = 5000

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 28, 28, 16)        160
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 16)        0
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 16)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 32)        4640
_________________________________________________________________
flatten (Flatten)            (None, 6272)              0
_________________________________________________________________
dense (Dense)                (None, 32)                200736
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                330
=================================================================
Total params: 205,866
Trainable params: 205,866
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples

Test loss: 0.24535114361345767
Test accuracy: 0.9174

Custom 2
Hidden layer = 3
node = 32
kernel size = (3,3)
pooling size = (2,2)
activation =  relu
kernel_initializer = he normal
epoch = 30
batch size = 128

row x col = 28x28
num classes = 10
validation size = 5000

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_2 (Conv2D)            (None, 28, 28, 32)        320
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 32)        0
_________________________________________________________________
dropout_2 (Dropout)          (None, 14, 14, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 64)        18496
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
dropout_3 (Dropout)          (None, 7, 7, 64)          0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 128)         73856
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 3, 128)         0
_________________________________________________________________
dropout_4 (Dropout)          (None, 3, 3, 128)         0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 3, 3, 256)         295168
_________________________________________________________________
flatten_1 (Flatten)          (None, 2304)              0
_________________________________________________________________
dense_2 (Dense)              (None, 256)               590080
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0
_________________________________________________________________
dense_3 (Dense)              (None, 10)                2570
=================================================================
Total params: 980,490
Trainable params: 980,490
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples

Test loss: 0.21931174544990062
Test accuracy: 0.9224


Custom 3
Hidden layer = 3
node = 64
kernel size = (3,3)
pooling size = (2,2)
activation =  relu
kernel_initializer = he normal
epoch = 30
batch size = 128

row x col = 28x28
num classes = 10
validation size = 5000

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_6 (Conv2D)            (None, 28, 28, 64)        640
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 14, 64)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 14, 14, 64)        0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 14, 14, 128)       73856
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 7, 7, 128)         0
_________________________________________________________________
dropout_7 (Dropout)          (None, 7, 7, 128)         0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 7, 7, 256)         295168
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 3, 3, 256)         0
_________________________________________________________________
dropout_8 (Dropout)          (None, 3, 3, 256)         0
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 3, 3, 512)         1180160
_________________________________________________________________
flatten_2 (Flatten)          (None, 4608)              0
_________________________________________________________________
dense_4 (Dense)              (None, 512)               2359808
_________________________________________________________________
dropout_9 (Dropout)          (None, 512)               0
_________________________________________________________________
dense_5 (Dense)              (None, 10)                5130
=================================================================
Total params: 3,914,762
Trainable params: 3,914,762
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples

Test loss: 0.22990238210856914
Test accuracy: 0.9279
