Optimizer

Hidden layer = 3
node = 32
kernel size = (2,2)
pooling size = (2,2)
activation =  relu
kernel_initializer = he normal
epoch = 30
batch size = 128

row x col = 28x28
num classes = 10
validation size = 5000

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 28, 28, 32)        160
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 32)        0
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 32)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        8256
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
dropout_1 (Dropout)          (None, 7, 7, 64)          0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         32896
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 128)         0
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 3, 128)         0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 3, 256)         131328
_________________________________________________________________
flatten (Flatten)            (None, 2304)              0
_________________________________________________________________
dense (Dense)                (None, 256)               590080
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2570
=================================================================
Total params: 765,290
Trainable params: 765,290
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples

Adam
Test loss: 0.22691999611854552
Test accuracy: 0.9191

Adagrad
Test loss: 0.2762889376878738
Test accuracy: 0.8979

RMSProp
Test loss: 0.2908400557279587
Test accuracy: 0.9013

AdaDelta
Test loss: 0.2248985800385475
Test accuracy: 0.919