Activation

Hidden layer = 2
node = 32
kernel size = (2,2)
pooling size = (2,2)
kernel_initializer = he normal
epoch = 30
batch size = 128

row x col = 28x28
num classes = 10
validation size = 5000
Added: leakyrelu function ==> alpha= 0.5

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 28, 28, 32)        160
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 32)        0
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 32)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        8256
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
dropout_1 (Dropout)          (None, 7, 7, 64)          0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 64)          16448
_________________________________________________________________
flatten (Flatten)            (None, 3136)              0
_________________________________________________________________
dense (Dense)                (None, 64)                200768
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                650
=================================================================
Total params: 226,282
Trainable params: 226,282
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples

Relu
Test loss: 0.23236404973864555
Test accuracy: 0.9158

Selu
Test loss: 0.2637153380960226
Test accuracy: 0.9137

Leakyrelu
Test loss: 0.2723049953699112
Test accuracy: 0.9031