Regularizer

Hidden layer = 3
node = 32
kernel size = (3,3)
pooling size = (2,2)
kernel_initializer = he normal
activation = relu
optimizer = adam
epoch = 30
batch size = 128

row x col = 28x28
num classes = 10
validation size = 5000

None

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 28, 28, 32)        320
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 32)        0
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 32)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        18496
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
dropout_1 (Dropout)          (None, 7, 7, 64)          0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         73856
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 128)         0
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 3, 128)         0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 3, 256)         295168
_________________________________________________________________
flatten (Flatten)            (None, 2304)              0
_________________________________________________________________
dense (Dense)                (None, 256)               590080
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2570
=================================================================
Total params: 980,490
Trainable params: 980,490
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples

Test loss: 0.21165784407258034
Test accuracy: 0.9251

Dropout

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_4 (Conv2D)            (None, 28, 28, 32)        320
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 32)        0
_________________________________________________________________
dropout_3 (Dropout)          (None, 14, 14, 32)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 14, 14, 64)        18496
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
dropout_4 (Dropout)          (None, 7, 7, 64)          0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 7, 7, 128)         73856
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 3, 3, 128)         0
_________________________________________________________________
dropout_5 (Dropout)          (None, 3, 3, 128)         0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 3, 3, 256)         295168
_________________________________________________________________
dropout_6 (Dropout)          (None, 3, 3, 256)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 2304)              0
_________________________________________________________________
dense_2 (Dense)              (None, 256)               590080
_________________________________________________________________
dense_3 (Dense)              (None, 10)                2570
=================================================================
Total params: 980,490
Trainable params: 980,490
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples

Test loss: 0.2011368911355734
Test accuracy: 0.9291

L1

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_8 (Conv2D)            (None, 28, 28, 32)        320
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 14, 14, 32)        0
_________________________________________________________________
dropout_7 (Dropout)          (None, 14, 14, 32)        0
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 14, 14, 64)        18496
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
dropout_8 (Dropout)          (None, 7, 7, 64)          0
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 7, 7, 128)         73856
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 3, 3, 128)         0
_________________________________________________________________
dropout_9 (Dropout)          (None, 3, 3, 128)         0
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 3, 3, 256)         295168
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 1, 1, 256)         0
_________________________________________________________________
flatten_2 (Flatten)          (None, 256)               0
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792
_________________________________________________________________
dense_5 (Dense)              (None, 10)                2570
=================================================================
Total params: 456,202
Trainable params: 456,202
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples


Test loss: 0.24048134461641313
Test accuracy: 0.9133

L2

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_12 (Conv2D)           (None, 28, 28, 32)        320
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 14, 14, 32)        0
_________________________________________________________________
dropout_10 (Dropout)         (None, 14, 14, 32)        0
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 14, 14, 64)        18496
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 7, 7, 64)          0
_________________________________________________________________
dropout_11 (Dropout)         (None, 7, 7, 64)          0
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 7, 7, 128)         73856
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 3, 3, 128)         0
_________________________________________________________________
dropout_12 (Dropout)         (None, 3, 3, 128)         0
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 3, 3, 256)         295168
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 1, 1, 256)         0
_________________________________________________________________
flatten_3 (Flatten)          (None, 256)               0
_________________________________________________________________
dense_6 (Dense)              (None, 256)               65792
_________________________________________________________________
dense_7 (Dense)              (None, 10)                2570
=================================================================
Total params: 456,202
Trainable params: 456,202
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples


Test loss: 0.24873313145637513
Test accuracy: 0.9116
