Initialization

Hidden layer = 3
node = 32
kernel size = (2,2)
pooling size = (2,2)
activation =  relu
epoch = 30
batch size = 128

row x col = 28x28
num classes = 10
validation size = 5000

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 28, 28, 32)        160
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 32)        0
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 32)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        8256
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
dropout_1 (Dropout)          (None, 7, 7, 64)          0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 64)          16448
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 64)          0
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 3, 64)          0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 3, 64)          16448
_________________________________________________________________
flatten (Flatten)            (None, 576)               0
_________________________________________________________________
dense (Dense)                (None, 64)                36928
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                650
=================================================================
Total params: 78,890
Trainable params: 78,890
Non-trainable params: 0
_________________________________________________________________
Train on 55000 samples, validate on 5000 samples

He normal
Test loss: 0.23591376934051514
Test accuracy: 0.9135

He uniform
Test loss: 0.24759909323453902
Test accuracy: 0.9113

Xavier normal
Test loss: 0.24391199246644973
Test accuracy: 0.9115

Xavier uniform
Test loss: 0.23967066915035248
Test accuracy: 0.9119